RM316/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet 
    {
        type            zeroGradient;
    }

    volume 
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    top 
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    bottom 
    {
        type            zeroGradient;
    }
    left 
    {
        type            zeroGradient;
    }
    right 
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
