RM316/0/nut

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet 
    {
        type            zeroGradient;
    }

    outlet    
    {
        type            zeroGradient;
    }

    bottom 
    {
        type            zeroGradient;
    }

    top 
    {
        type            calculated;
        value           uniform 0;
    }

    right 
    {
        type            zeroGradient;
    }

    left 
    {
        type            zeroGradient;
    }

    volume 
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
