RM316/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          2800;
        startFace       668285;
    }
    left
    {
        type            patch;
        nFaces          2835;
        startFace       671085;
    }
    right
    {
        type            patch;
        nFaces          2835;
        startFace       673920;
    }
    outlet
    {
        type            patch;
        nFaces          2800;
        startFace       676755;
    }
    top
    {
        type            patch;
        nFaces          6480;
        startFace       679555;
    }
    bottom
    {
        type            patch;
        nFaces          6480;
        startFace       686035;
    }
)

// ************************************************************************* //
